FemDesign.Results.BarEndForce
FemDesign "Bars, End forces" result

FemDesign.Results.BarEndForce.Id
Bar name identifier

FemDesign.Results.BarEndForce.End
Start or end node of bar. End is true.

FemDesign.Results.BarEndForce.Fx
Axial force

FemDesign.Results.BarEndForce.Fy
Shear force along major axis

FemDesign.Results.BarEndForce.Fz
Shear force along minor axis

FemDesign.Results.BarEndForce.Mx
Moment around axis

FemDesign.Results.BarEndForce.My
Moment around major bending axis

FemDesign.Results.BarEndForce.Mz
Moment around minor bending axis

FemDesign.Results.BarEndForce.CaseIdentifier
Load case or combination name